#lang sicp

(define (gcd a b)
  (if (= b 0)
      a
      (gcd b (remainder a b))))

;; 计算 (gcd 206 40) 需要调用 remainder 多少次?

;; 1、如果使用正则序，if 按常规语法
(gcd 206 40)
(= 40 0)
#f
(gcd 40 (r 206 40)) ;; 40 6
(= (r 206 40) 0)
#f
(gcd (r 206 40)
     (r 40 (r 206 40))) ;; 6 4
(= (r 40 (r 206 40)) 0)
#f
(gcd (r 40 (r 206 40))
     (r (r 206 40) (r 40 (r 206 40)))) ;; 4 2
(=  (r (r 206 40) (r 40 (r 206 40))) 0)
#f
(gcd (r (r 206 40) (r 40 (r 206 40)))
     (r (r 40 (r 206 40)) (r (r 206 40) (r 40 (r 206 40))))) ;; 2 0
(= (r (r 40 (r 206 40)) (r (r 206 40) (r 40 (r 206 40)))) 0)
#t
(r (r 206 40) (r 40 (r 206 40)))
2
;; 仔细观察，计算 (gcd a b) 中 a b 的 remainder 个数
;; (gcd 206 40): 0 0
;; (gcd 40 6): 0 1
;; (gcd 6 4): 1 2
;; (gcd 4 2): 2 4
;; (gcd 2 0): 4 7
;; 所以应该是所有 if 判断的 b 和最后返回的 a 所调用的 remainder 的总数，0 + 1 + 2 + 4 + 7 + 4 = 18

;; 2、如果是应用序，则 remainder 调用次数为4（只在 gcd 代入实参时估值）
(gcd 206 40)
(= 40 0) #f
(gcd 40 (r 206 40))
(= 6 0) #f
(gcd 6 (r 40 6))
(= 4 0) #f
(gcd 4 (r 6 4))
(= 2 0) #f
(gcd 2 (r 4 2))
(= 0 0) #t
2